Autodesk.Revit.DB.GBXMLExportOptions.GetMassZoneIds
Gets a list of mass zones to analyze in the exported gbXML.
Returns:
The ids of the mass zones.
Since:
2025

Autodesk.Revit.DB.GBXMLExportOptions.GetMassIds
Gets a list of masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
Returns:
The ids of the masses.
Since:
2025

Autodesk.Revit.DB.GBXMLExportOptions.IsConceptual
Indicates if the exported gbXML is based on a conceptual energy analytical model from a conceptual mass model.
Since:
2025

Autodesk.Revit.DB.GBXMLExportOptions.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Constructs a new instance of the options used to export a mass model to gbXML.
massZoneIds:
Indicates the mass zones to analyze in the exported gbXML.
massIds:
Indicates the masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025